{
  "kimura": "A powerful shoulder lock typically used from closed guard, side control, or north-south.",
  "armbar": "An elbow joint lock applied by isolating the opponent’s arm and hyperextending it, often from mount or guard.",
  "triangle": "A blood choke performed from guard by trapping the opponent's neck and one arm between your legs.",
  "guillotine": "A front headlock choke applied when the opponent’s head is low, commonly hit during takedown attempts.",
  "omoplata": "A shoulder lock using the legs, usually executed from closed guard or rubber guard.",
  "rear naked choke": "A choke applied from back control that compresses the carotid arteries using the arms.",
  "americana": "A shoulder lock that torques the arm outward, usually done from side control or mount.",
  "anaconda": "A choke that wraps around the opponent's neck and arm, generally set up from front headlock position.",
  "darce": "A choke where the arm threads under the opponent’s armpit and through the neck, locking up similar to an anaconda.",
  "loop choke": "A gi choke that uses your collar to wrap around the opponent’s neck, often from seated or standing grips.",
  "bow and arrow choke": "A powerful gi choke applied from back control by pulling on the collar while extending the opponent’s leg.",
  "cross collar choke": "A gi choke from guard or mount that uses both hands in the opponent’s collar to choke them.",
  "x choke": "A variation of the cross collar choke done from mount or closed guard by crossing the arms in the collar.",
  "ezekiel choke": "A gi choke done with your own sleeve while in mount or even inside closed guard.",
  "straight ankle lock": "A basic foot lock targeting the Achilles tendon, often done from Ashi Garami.",
  "heel hook": "A leg lock that attacks the knee via heel rotation; extremely dangerous and often no-gi only.",
  "knee bar": "A submission that hyperextends the knee, usually from top or bottom leg entanglements.",
  "north south choke": "A choke from north-south position using shoulder pressure and arm placement.",
  "peruvian necktie": "A flashy choke from front headlock where you step over the opponent’s head and sit back.",
  "baseball bat choke": "A gi choke using both sleeves like a bat grip, often from side control or knee on belly.",
  "looping collar drag": "A collar grip used to off-balance and sweep or take the back from seated guard.",
  "lapel trap armbar": "A setup using your own lapel to trap their arm for an armbar, typically in gi from guard or mount.",
  "sumi gaeshi": "A sacrifice throw from butterfly guard or seated position using underhooks.",
  "back take from deep half": "A transition where you rotate under and behind your opponent from deep half guard.",
  "underhook sweep": "A powerful sweep from half guard using an underhook and pressure into the opponent’s base.",
  "over under pass": "A tight pressure-based guard pass using one arm under and one over the opponent's legs.",
  "knee slice pass": "A dynamic guard pass that slices the knee across the thigh to establish side control."
}
